04_Simulation/PH_Cases/Mesh_270_by_290/steadyState_2D_Baseline_RANS_SST/0/wallGradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallGradU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
270
(
(6.1826558 -0 -0)
(6.1832101 -0 -0)
(6.1831623 -0 -0)
(6.1811558 -0 -0)
(6.1758494 -0 -0)
(6.165929 -0 -0)
(6.1502378 -0 -0)
(6.1278401 -0 -0)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
270
(
(6.1827433 -0 -0)
(6.1832778 -0 -0)
(6.1834254 -0 -0)
(6.1848531 -0 -0)
(6.1921502 -0 -0)
(6.2126105 -0 -0)
(6.2555985 -0 -0)
(6.331292 -0 -0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
